
%-------------------------------------------------------------------------
% FILE: data.m
% AUTH: Liu Bing
% Created: 2009/07/13
% Modified: 2009/0717
% DESC: Simulation of measured voltage measurements with 0.1 volt RMS white 
%       noise (actual voltage should be -0.37727 volts).
% Problem: 1.结果中的kalman曲线的前段与答案相比不准确； (已解决：090717)
%          2.kalman曲线的第一个点，即x(0)的值怎么取？ (已解决：090717)
%-------------------------------------------------------------------------

clear all; clc;


%-------------------- initialize some varibles ---------------------------
N=50; 
xhat=0;  % modified by liubing
p0=1; 
Q=10^-6; 
R=10^-2; 
t=1:N; 
%-------------------------------------------------------------------------


%------ 程序中虚拟的测量值，应该没用，测量值在已给出（voltage） --------
% modified by liubing
%for i=1:N 
%    z(i)=-0.37727+randn*3; 
%end 
%mean(z),std(z) 
%plot(t,z,'k');hold on 


%---------------------NOISY MEASUREMENT-----------------------------------
voltage = [-0.46687,-0.36375,-0.39117,-0.49361,-0.2589,-0.37881,-0.32365,...
    -0.44891,-0.44283,-0.34583,-0.36659,-0.19245,-0.40478,-0.15601,-0.22642,...
    -0.57178,-0.54532,-0.43462,-0.39585,-0.37638,-0.29358,-0.4495,-0.44942,...
    -0.39739,-0.37932,-0.34938,-0.27144,-0.3151,-0.55233,-0.30754,-0.29612,...
    -0.31364,-0.24626,-0.34456,-0.44457,-0.3922,-0.62217,-0.32994,-0.36558,...
    -0.43638,-0.44274,-0.48534,-0.38204,-0.33934,-0.41031,-0.42726,-0.38087,...
    -0.39475,-0.473,-0.24802;];
%------------------------------------------------------------------------- 

 
%------------------- 各计算变量赋予初始值----------------------------------
z = voltage;    %已给的测量变量放入vector 
y(1) = xhat; 
p1(1) = p0+Q; 
kg(1) = p1(1)/(p1(1)+R); 
%注意：此处从z(2)开始估计x的第二个值（为了计算直观，与kalman公式一致，此处先写成
%x(1),计算完成后再在x(1)前面插入x的第一个值，即xhat），因为第一个值以确定
x(1) = y(1)+kg(1)*(z(2)-y(1));   % modified by liubing
p(1) = (1-kg(1))*p1(1); 
%-------------------------------------------------------------------------


%------------------ 递归计算各kalman值x(i)及其他计算变量 -------------------
for i=2:N-1 
    y(i)=x(i-1); 
    p1(i)=p(i-1)+Q; 
    kg(i)=p1(i)/(p1(i)+R); 
    x(i)=y(i)+kg(i)*(z(i+1)-y(i));  % modified by liubing (z(i)改成z(i+1))
    p(i)=(1-kg(i))*p1(i); 
end 
x = [xhat,x];  % 将xhat插入x矩阵的第一个，因为它是第一个值 
%-------------------------------------------------------------------------


%-------------------------- plot figures ---------------------------------
plot([0 50],[-0.37727 -0.37727],'-r'); hold on;   % 绘制X轴横坐标
plot(t-1,voltage,'-b');    % 绘制测量值图形
plot(t-1,x,'-g');   % 绘制kalman值图形
axis([0 50 -0.7 0]);
xlabel('time');
ylabel('voltage');
legend('true','measured','kalman');
%-------------------------------------------------------------------------



